Autodesk.Revit.DB.Color.InvalidColorValue
Get the invalid Color whose IntegerValue is -1.
Since: 2014

Autodesk.Revit.DB.Color.IsValid
Identifies if the color represents a valid color, or an uninitialized/invalid value.
Since: 2012

Autodesk.Revit.DB.Color.Blue
Get the blue channel of the color.  Setting a channel is obsolete in Autodesk Revit 2013.  Please create a new color instead.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: When getting the value: the color is invalid or uninitialized.

Autodesk.Revit.DB.Color.Green
Get the green channel of the color.  Setting a channel is obsolete in Autodesk Revit 2013.  Please create a new color instead.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: When getting the value: the color is invalid or uninitialized.

Autodesk.Revit.DB.Color.Red
Get the red channel of the color.  Setting a channel is obsolete in Autodesk Revit 2013.  Please create a new color instead.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: When getting the value: the color is invalid or uninitialized.

Autodesk.Revit.DB.Color.#ctor(System.Byte,System.Byte,System.Byte)
Constructor that takes the red, green and blue channels of the color.
red: The red channel of the color that ranges from 0 to 255.
green: The green channel of the color that ranges from 0 to 255.
blue: The blue channel of the color that ranges from 0 to 255.

Autodesk.Revit.DB.Color
Represents a color in Autodesk Revit.
Remarks: Colors obtained from some API methods may represent an uninitialized/invalid color.  You can identify these
using the IsValid property.